job_emploes = 'официант'
job_emploes = 'официант'
job_emploes = 'официант'
job_emploes = 'официант'
job_emploes = 'официант'

waite = "Официант"

WAITER = "Официант"

name = input("Введите ваше имя")
age = input("Ваш возраст")
print("Привет " + name + "Вам " + age)

day = input("Введите день")
month = input("Введите месяц")
year = input("Введите год")
print(day,month,year,sep="-")

#Напишите программу, которая выводит следующий текст:
Пример вывода:
Путь к файлу: C:\Users\Username\Documents
#
print()
